file.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
    <soapenv:Header>
        <ns2:requestHeader xmlns:ns3="http://com.baj.retailServices" 
            xmlns:ns2="http://userServices">
            <language>EN</language>
            <requestID>c6f4366c-350e-4a5a-bb3a-18cb77d3a101</requestID>
            <userID>CORPSMARTUser1/...</userID>
            <customerNo>80084058</customerNo>
            <channelID>CORPSMART</channelID>
            <tokenKey/>
            <cuid/>
            <idNumber/>
            <rule>OS=ANDROID</rule>
        </ns2:requestHeader>
    </soapenv:Header>
    <soapenv:Body>
        <ns2:sendOTPSMSRequest xmlns:ns3="http://com.baj.retailServices" 
            xmlns:ns2="http://userServices">
            <customerNo>80084058</customerNo>
            <cuid>E80084058664</cuid>
            <mobileNo>0594931744</mobileNo>
            <otpServiceType>601</otpServiceType>
            <valuesList xsi:nil="true" 
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        </ns2:sendOTPSMSRequest>
    </soapenv:Body>
</soapenv:Envelope>